app/controllers/api/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.organizer_id = current_user.id
    if @event.save
---
INSERT INTO "events" ("organizer_id", "title", "location", "description", "event_image_url", "category_id", "min_price", "max_price", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show
    @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def index
    @events = Event.all
---
SELECT "events".* FROM "events"

  def destroy
    @event = Event.find_by(id: params[:id])
    if @event && current_user.id == @event.organizer_id
      @event.delete
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 189]]