app/controllers/api/tickets_controller.rb

  def create
    debugger
    @ticket = Ticket.new(ticket_params)
    if @ticket.save
---
INSERT INTO "tickets" ("ticket_name", "event_id", "price", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ticket_name", "asdf"], ["event_id", 184], ["price", 234], ["quantity", 23], ["created_at", "2018-02-08 03:11:42.315987"], ["updated_at", "2018-02-08 03:11:42.315987"]]